Repository: yoko-at-home/reactjs-docs-TM
Catalog: docs/faq-state_EN-US_ja.tmx
Source language: en_us
Languages: ja

source: --- id: faq-state title: Component State permalink: docs/faq-state.html layout: docs category: FAQ ---
ja: --- id: faq-state title: コンポーネントの state permalink: docs/faq-state.html layout: docs category: FAQ ---

source: ### What does `setState` do?
ja: ### `setState` は何をしているのですか？

source: `setState()` schedules an update to a component's `state` object.
ja: `setState()` はコンポーネントの `state` オブジェクト更新をスケジュールします。

source: When state changes, the component responds by re-rendering.
ja: state が更新されると、コンポーネントはそれに再レンダーで応じます。

source: ### What is the difference between `state` and `props`?
ja: ### `state` と `props` の違いは何ですか？

source: [`props`](/docs/components-and-props.html) (short for "properties") and [`state`](/docs/state-and-lifecycle.html) are both plain JavaScript objects.
ja: [`props`](/docs/components-and-props.html)（"properties" を短くしたもの）と [`state`](/docs/state-and-lifecycle.html) は、両方ともプレーンな JavaScript のオブジェクトです。

source: While both hold information that influences the output of render, they are different in one important way:
ja: どちらもレンダー結果に影響を及ぼす情報を持ってはいますが、ある重要な一点が異なっています。

source: `props` get passed *to* the component (similar to function parameters) whereas `state` is managed *within* the component (similar to variables declared within a function).
ja: つまり、`props` は（関数引数のように）コンポーネント*へ*渡されるのに対し、`state` は（関数内で宣言された変数のように）コンポーネント*の内部*で制御されます。

source: Here are some good resources for further reading on when to use `props` vs `state`: * [Props vs State](https://github.com/uberVU/react-guide/blob/master/props-vs-state.md) * [ReactJS: Props vs. State](https://lucybain.com/blog/2016/react-state-vs-pros/)
ja: `props` と `state` のどちらをいつ使うべきかについて、こちらでより詳しく読むことができます。* [Props vs State](https://github.com/uberVU/react-guide/blob/master/props-vs-state.md) * [ReactJS: Props vs.State](https://lucybain.com/blog/2016/react-state-vs-pros/)

source: ### Why is `setState` giving me the wrong value?
ja: ### `setState` が誤った値を返すのはなぜですか？

source: In React, both `this.props` and `this.state` represent the *rendered* values, i.e. what's currently on the screen.
ja: React では、`this.props` と `this.state` のいずれも、*レンダーされた*もの、つまりスクリーン上の値を表しています。

source: Calls to `setState` are asynchronous - don't rely on `this.state` to reflect the new value immediately after calling `setState`.
ja: `setState` 呼び出しは非同期です。呼び出し直後から `this.state` が新しい値を反映することを期待しないでください。

source: Pass an updater function instead of an object if you need to compute values based on the current state (see below for details).
ja: もし現在の state に基づいた値を計算する必要がある場合は、オブジェクトの代わりに更新関数を渡してください（詳しくは以下を参照）。

source: Example of code that will *not* behave as expected:
ja: このコード例は期待した通りには*動きません*。

source: // Note: this will *not* work as intended.
ja: // 補足：これは意図通りに*動きません*

source: // Let's say `this.state.count` starts at 0.
ja: // `this.state.count` は 0 から始まるとします。

source: // When React re-renders the component, `this.state.count` will be 1, but you expected 3.
ja: // React がコンポーネントを再レンダーしても、`this.state.count` は意図通りの 3 ではなく 1 になります。

source: // This is because `incrementCount()` function above reads from `this.state.count`,
ja: // これは、上記の `incrementCount()` 関数は `this.state.count` の値を読むのですが、

source: // but React doesn't update `this.state.count` until the component is re-rendered.
ja: // しかしコンポーネントが再レンダーされるまで React が `this.state.count` を更新しないためです。

source: // So `incrementCount()` ends up reading `this.state.count` as 0 every time, and sets it to 1.
ja: // そして `incrementCount()` は値が 0 のままの `this.state.count` を毎回読み、そして 1 をセットしてしまいます。

source: // The fix is described below!
ja: // 対処法は下で説明していますよ！

source: See below for how to fix this problem.
ja: この問題を解決するには以下を見てください。

source: ### How do I update state with values that depend on the current state?
ja: ### どうやって現在の state に依存する値を更新したらいいですか？

source: Pass a function instead of an object to `setState` to ensure the call always uses the most updated version of state (see below).
ja: `setState` へオブジェクトを渡す代わりに関数を渡してください。その関数は常に最新の状態の state を使って呼ばれることが保証されています（次項参照）。

source: ### What is the difference between passing an object or a function in `setState`?
ja: ### `setState` へオブジェクトを渡すのと関数を渡すのとのでは何が違いますか？

source: Passing an update function allows you to access the current state value inside the updater.
ja: 更新関数を渡すと、その関数内で現在の state の値へアクセスできるようになります。

source: Since `setState` calls are batched, this lets you chain updates and ensure they build on top of each other instead of conflicting:
ja: `setState` 呼び出しはバッチ処理されるため、更新処理を連結して、それぞれの更新が競合せずに順序だって動作することが保証されます。

source: // Important: read `state` instead of `this.state` when updating.
ja: // 重要：更新には `this.state` ではなく `state` を使います。

source: // If you read `this.state.count` now, it would still be 0.
ja: // ここで `this.state.count` を読んでもまだ 0 のままです。

source: // But when React re-renders the component, it will be 3.
ja: // しかし React がコンポーネントを再レンダーするとき、値は 3 になります。

source: [Learn more about setState](/docs/react-component.html#setstate)
ja: [setState についてもっと学ぶ](/docs/react-component.html#setstate)

source: ### When is `setState` asynchronous?
ja: ### いつ `setState` は非同期になりますか？

source: Currently, `setState` is asynchronous inside event handlers.
ja: 現在、`setState` はイベントハンドラの内側では非同期です。

source: This ensures, for example, that if both `Parent` and `Child` call `setState` during a click event, `Child` isn't re-rendered twice.
ja: 例えばクリックイベントの間に `Parent` と `Child` の両方が `setState` を呼ぶとき、非同期処理のおかげで `Child` が 2 度レンダーされないことが保証されます。

source: Instead, React "flushes" the state updates at the end of the browser event.
ja: その代わりに React はブラウザイベントの最後に state の更新を「フラッシュ (flush)」します。

source: This results in significant performance improvements in larger apps.
ja: これにより大規模アプリのパフォーマンスが大幅に向上します。

source: This is an implementation detail so avoid relying on it directly.
ja: これは実装の詳細ですので、この仕組みに直接依存しないようにしてください。

source: In the future versions, React will batch updates by default in more cases.
ja: 将来のバージョンにおいて、React はより多くの場合にバッチ更新するようになります。

source: ### Why doesn't React update `this.state` synchronously?
ja: ### どうして React は `this.state` を同期的に更新しないのですか？

source: As explained in the previous section, React intentionally "waits" until all components call `setState()` in their event handlers before starting to re-render.
ja: 前項で説明したように、全てのコンポーネントがそのイベントハンドラ内で `setState()` を呼ぶまで、React は再レンダー前に意図的に「待つ」ようになっています。

source: This boosts performance by avoiding unnecessary re-renders.
ja: これにより不必要な再レンダーが防がれ、パフォーマンスが向上します。

source: However, you might still be wondering why React doesn't just update `this.state` immediately without re-rendering.
ja: とはいえ、React がどうして再レンダーなしに `this.state` を即時更新しないのか、まだ疑問に思っているかもしれません。

source: There are two main reasons:
ja: これには主に 2 つの理由があります。

source: * This would break the consistency between `props` and `state`, causing issues that are very hard to debug.
ja: * 同期的更新が `props` と `state` の間の一貫性を破壊し、非常にデバッグが難しい問題を引き起こしうるため。

source: * This would make some of the new features we're working on impossible to implement.
ja: * 同期的更新が、我々が取り組んでいる新機能のいくつかを実装不可能にしうるため。

source: This [GitHub comment](https://github.com/facebook/react/issues/11527#issuecomment-360199710) dives deep into the specific examples.
ja: この [GitHub コメント](https://github.com/facebook/react/issues/11527#issuecomment-360199710)は特定の例について詳しく解説しています。

source: ### Should I use a state management library like Redux or MobX?
ja: ### Redux や MobX のような state 管理ライブラリを使うべきでしょうか？

source: [Maybe.](https://redux.js.org/faq/general#when-should-i-use-redux)
ja: [時には必要かもしれません。](https://redux.js.org/faq/general#when-should-i-use-redux)

source: It's a good idea to get to know React first, before adding in additional libraries.
ja: まずは他のライブラリを追加する前に React を理解することをお勧めします。

source: You can build quite complex applications using only React.
ja: React だけでも非常に複雑なアプリケーションを作り上げることができます。
